Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བདུན་ཅུའོ། །
en: in the second there will be seventy billion;

source: གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བརྒྱད་ཅུའོ། །
en: in the third, eighty billion;

source: བཞི་པ་ལ་ནི་འབུམ་ཕྲག་དགུ་བཅུའོ། །
en: in the fourth, ninety billion;

source: ལྔ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བརྒྱའོ། །
en: and in the fifth, one hundred billion.

source: དེ་བཞིན་གཤེགས་པ་གཙུག་ན་རིན་པོ་ཆེ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་བརྩེགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnacūḍa will be born in a place called Stacked Qualities.

source: ཡབ་ནི་རིན་ཆེན་འགྲོས་ཞེས་བྱའོ། །
en: Jewel Mode will be his father.

source: ཡུམ་ནི་བསོད་ནམས་འཕེལ་ཞེས་བྱའོ། །
en: Merit Increase will be his mother.

source: སྲས་ནི་ཆོས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Dharma will be his son.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Divine King will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་དང་འབུམ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be seventy consecutive congregations, each of them gathering three million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་བྲལ་སྐྱེ་བའི་ཡུལ་ནི་ཚེ་སྦྱིན་ཞེས་བྱའོ། །
en: “The thus-gone Vigatabhaya will be born in a place called Gift of Life.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཁྲིའོ། །
en: His light will extend sixty thousand leagues.

source: ཡབ་ནི་འོད་བཟངས་ཞེས་བྱའོ། །
en: Excellent Light will be his father.

source: ཡུམ་ནི་མཆོད་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Worshiper will be his mother.

source: སྲས་ནི་ངེས་མཐོང་ཞེས་བྱའོ། །
en: Certain Sight will be his son.

source: རིམ་གྲོ་པ་ནི་ངེས་བྱིན་ཞེས་བྱའོ། །
en: Certain Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་བརྟན་ཞེས་བྱའོ། །
en: Stable Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲང་སྲོང་གཙོ་ཞེས་བྱའོ། །
en: Sage Leader will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་ཏུ་ཟད་དོ། །དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་དོ། །
en: There will be only one congregation, gathering innumerable members of the saṅgha of monks.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་སྙིང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཕུང་པོ་ལས་གྲོལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnagarbha will be born in a place called Free from the Aggregates.

source: འོད་ནི་དཔག་ཚད་འབུམ་ཕྲག་བརྒྱ་དྲུག་ཅུའོ། །
en: His light will extend six hundred million leagues.

source: ཡབ་ནི་ཡེ་ཤེས་འོད་ཅེས་བྱའོ། །
en: Light of Wisdom will be his father.

source: ཡུམ་ནི་རིན་ཆེན་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Jewel of Intelligence will be his mother.

source: སྲས་ནི་པད་མའི་མཛོད་ཅེས་བྱའོ། །
en: Lotus Treasury will be his son.

source: རིམ་གྲོ་པ་ནི་རྣམ་པར་གྲགས་པའི་སྒྲ་ཞེས་བྱའོ། །
en: Resounding Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚུགས་པ་མེད་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Indomitable Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་གནས་སེམས་ཞེས་བྱའོ། །
en: Nonabiding Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་འབུམ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be seventy consecutive congregations, each of them gathering fourteen trillion.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one billion years.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་ཞལ་སྐྱེ་བའི་ཡུལ་ནི་དྲི་མ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnacandra will be born in a place called Stainless.

source: འོད་ནི་དཔག་ཚད་བཞི་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: His light will extend forty-two thousand leagues.

source: ཡབ་ནི་མིག་བཟངས་ཞེས་བྱའོ། །
en: Excellent Eye will be his father.

source: ཡུམ་ནི་མིག་བྱིན་ཞེས་བྱའོ། །
en: Eye Gift will be his mother.

source: སྲས་ནི་ཟླ་སྡུག་ཅེས་བྱའོ། །
en: Delightful Moon will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤོབས་པའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence of Acumen will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་མི་འཁྲུག་ཅེས་བྱའོ། །
en: Unperturbed Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be six consecutive congregations, each of them gathering two hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་ཚེར་མ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vimalakīrti will be born in a place called Without Thorns.

source: ཡབ་ནི་གསུམ་རིག་ཅེས་བྱའོ། །
en: Triple Knowledge will be his father.

source: ཡུམ་ནི་བློ་བཟངས་མ་ཞེས་བྱའོ། །
en: Excellent Wisdom will be his mother.

source: སྲས་ནི་འདམ་རྫབ་མེད་ཅེས་བྱའོ། །
en: Without Mud will be his son.

source: རིམ་གྲོ་པ་ནི་མིའི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Humanity will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲགས་ཞེས་བྱའོ། །
en: Renowned Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྡ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: Sign Expert will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be thirty consecutive congregations, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཞི་བའི་གཟི་བརྗིད་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: The thus-gone Śāntatejas will be born in a place called Infinite Splendor.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྙེད་ཙམ་མོ། །
en: His light will extend as far as one hundred worlds of four continents.

source: ཡབ་ནི་གཟི་བརྗིད་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Splendor will be his father.

source: སྲས་ནི་གཟི་བརྗིད་མེ་ཏོག་ཅེས་བྱའོ། །
en: Splendid Flower will be his son.

source: རིམ་གྲོ་པ་ནི་གཟི་བརྗིད་འཇམ་པ་ཞེས་བྱའོ། །
en: Gentle Splendor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོགས་པ་མེད་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Unimpeded Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Power and Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be sixty-nine consecutive congregations, each of them gathering eighty million.

source: དེ་བཞིན་གཤེགས་པ་དགའ་བའི་ཏོག་གི་ནི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Priyaketu will be born in a place Called Joyful.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལེགས་བཟངས་ཡིན། །ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Exquisite Excellence will be his father and Dharma Intelligence his mother;

source: སྲས་པོ་འོད་བྱེད་དགེ་བ་རིམ་གྲོ་པ། །
en: Illuminator will be his son and Virtue his attendant.

source: གྲགས་མཆོག་ཅེས་བྱ་བ་ནི་མཁས་པ་སྟེ། །
en: Supreme Fame will be the scholar

source: རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Illuminator the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་སྟེ། །ཀུན་ལའང་ཉོན་མོངས་སྤངས་པ་དགྲ་བཅོམ་པ། །བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གསུམ་གསུམ། །
en: “There will be eighty congregations, each of which will gather Seven hundred thirty billion worthy ones Who have relinquished all defilements.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་གསུམ། །
en: The lifespan of humankind will be seventy-three thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: “After this knower of the world has transcended suffering His sacred Dharma will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །དེ་ཡི་མཆོད་རྟེན་སྟོང་ཕྲག་བདུན་ཅུ་དྲུག །
en: The relics of this victor will be abundant, And there will be seventy-six thousand stūpas.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་ལྷ་ཡི་ནི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Rāhudeva Will be born in a place called Joyful.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཡོད་ཡབ་ནི་གཟི་བརྗིད་བཟང་། །སྐལ་ལྡན་ཤིང་རྟ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: The family of this victor will be kṣatriya, And his light will extend eight leagues. “Excellent Splendor will be his father and Chariot of the Fortunate his mother;

source: སྲས་པོ་བླ་མེད་ལྗོན་པ་རིམ་གྲོ་པ། །
en: Unsurpassable will be his son and Tree his attendant.

source: ང་རོ་སྙན་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Delightful Roar will be the scholar

source: བདེ་བར་སོང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Gone to Bliss the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །
en: “There will be sixty-six congregations,

source: ཀུན་ལའང་བྱེ་ཕྲག་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: Each of them gathering two hundred million.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་གཉིས། །
en: The lifespan of humans will be twenty-two thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་གསུམ་དུ་གནས། །
en: And after the completion of exhaustion “The teachings will remain for ninety-three thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་རིན་པོ་ཆེ་ཡིས་སྤྲས། །མཆོད་རྟེན་བྱེ་བ་བརྒྱད་ཅུ་རྩ་དྲུག་སྟེ། །རིན་ཆེན་སྣ་བདུན་དག་གིས་བརྒྱན་པར་འགྱུར། །
en: The relics will be abundant, and the jewel-studded stūpas, Adorned with the seven precious substances, Will number eight hundred sixty million.

source: འཇིག་རྟེན་འདྲེན་པ་ན་ཚོད་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་བརྒྱན་ཅེས་བྱ། །
en: “The guide of the world, Suvayas, Will be born in a place called Adorned with Jewels.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་འབྱོར་པ་ཡིན། །སྐྱེ་བའི་མཆོད་རྟེན་ཡུམ་ཡིན་སྲས་པོ་ནི། །སྒྲ་གཅན་དགའ་བ་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Wealth will be his father and Stūpa for Humanity his mother; Rāhu will be his son and Excellent Joy his attendant.

source: རྐང་འགྲོ་ཞེས་བྱ་དེ་ནི་མཁས་པ་སྟེ། །
en: Moving Legs will be the scholar

source: རྣམ་པར་སྒྲོགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་མཆོག །
en: And Proclaimer the one of supreme miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་སྟེ། །ཀུན་ལའང་དགྲ་བཅོམ་ཐམས་ཅད་གཡོ་མེད་པ། །རྣམ་གྲོལ་དྲི་མེད་བྱེ་བ་ཕྲག་བཅུ་བཅུ། །
en: “There will be eighty congregations, Each of which will gather one hundred million Completely unshakable worthy ones, Liberated and stainless.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བརྒྱད་ཁྲི་ཡིན། །
en: “The lifespan of humans will be eighty thousand years,

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །ལོ་སྟོང་བར་དུ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར། །
en: And after the knower of the world has attained nirvāṇa The wheel of his Dharma will still be turned for one thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་ཁོ་ར་ཁོར་ཡུག་ཏུ། །མཆོད་རྟེན་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞིས་བརྒྱན། །
en: The relics will be abundant and contained in sixty-four thousand “Continuously circumambulated stūpas.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་དགའ་ཞེས་བྱ་བའི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡིས་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Amarapriya Will be born in a place called Adorned with the Gods.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་ན་ཚོད་བཟང་། །མཉམ་པར་སེམས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, “And his light will extend ten million leagues. Excellent Youth will be his father and Equanimous Mind his mother;

source: སྲས་པོ་དགའ་སྡུག་དགའ་བོ་རིམ་གྲོ་པ། །
en: Beautiful Joy will be his son and Joyous his attendant.

source: མི་ཡི་སེང་གེ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Lion of Humans will be the scholar

source: བདུད་འཇོམས་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Māra Crusher the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །འདུས་པ་ཀུན་ལའང་བློ་གྲོས་རབ་ཞི་བ། །བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be thirty-six congregations, Each of them gathering sixty-two billion Intelligent ones who have attained the highest peace.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་གསུམ། །
en: “The lifespan of humans will be twenty-three thousand years,

source: སྟོན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་གཉིས་སུ་འབར། །
en: And after the teacher has attained nirvāṇa His sacred Dharma will remain For seventy-two thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་པོ་དག །བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་འབྱུང་། །
en: “His relics will be abundant, and there will appear Nine hundred ninety billion excellent stūpas.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Ratnaskandha Will be born in a place called Adorned with Jewels.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་འཁྲུག་མེད་ཡིན། །རིན་ཆེན་མཆོག་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya and his light will extend seventy leagues. Unperturbed will be his father; Supreme Jewel be this victor’s mother.

source: སྲས་པོ་ལེགས་སེམས་ཟླ་བ་རིམ་གྲོ་པ། །
en: Excellent Mind will be his son and Moon his attendant.

source: མཆོག་དབྱངས་ཞེས་བྱ་དེ་ནི་མཁས་པ་སྟེ། །
en: “Supreme Melody will be the scholar

source: རྒོལ་བ་ཚར་གཅོད་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Defeater of Attacks the one of miracles.

source: ཀུན་ལའང་དྲི་མེད་གཡོ་མེད་ལུས་སྦྱངས་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: Each of them gathering nine hundred thirty million “Stainless and unshakable beings of purified bodies.

source: བདེ་གཤེགས་འགོག་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱ་ཕྲག་བཅུ་ཡི་བར་དུ་གནས། །
en: And after this well-gone one has reached cessation His sacred Dharma will remain for a thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་ཡང་། །འཕང་དུ་དཔག་ཚད་ལྔ་ཡི་ཚད་ཙམ་ཡིན། །
en: “His relics will remain in a single collection Within a stūpa five leagues tall.

source: དེ་བཞིན་གཤེགས་པ་མཛེས་པར་གཤེགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྡུག་ཅིང་དགའ་ཞེས་བྱ། །
en: The thus-gone Laḍitavikrama Will be born in a place called Beautiful and Delightful.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་འོད་ཟེར་བཟང་། །མེ་ཏོག་ཅན་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin and his light will extend three leagues. Excellent Light Rays will be his father, And Endowed with Flowers will be this victor’s mother.

source: སྲས་པོ་བྱམས་པ་བློ་བཟངས་རིམ་གྲོ་པ། །
en: Love will be his son and Excellent Mind his attendant.

source: བློ་མཆོག་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Supreme Mind will be the scholar

source: རྣམ་པར་འཕྲུལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Miraculous Display the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་ང་མེད་ཐམས་ཅད་རིམས་མེད་པ། །སྲིད་གྲོལ་བྱེ་བ་ཕྲག་ནི་གསུམ་གསུམ་ཡོད། །
en: There will be sixty-six congregations, Each of them gathering thirty million “Selfless and untroubled beings, liberated from existence.

source: མི་ཚེའི་ཚད་ནི་ལོ་གྲངས་བྱེ་བ་ཡིན། །
en: The lifespan of humans will be ten million years,

source: རབ་ཏུ་ཞི་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་གཅིག་ཏུ་གནས། །
en: And after this teacher has gone to the highest peace His sacred Dharma will remain for ninety-one thousand years.

source: འཇིག་རྟེན་མཁྱེན་པའི་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ། །
en: “The relics of this knower of the world will be abundant, Contained in two hundred thirty million stūpas.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཕྱོགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: The thus-gone Siṃhapakṣa Will be born in a place called Endowed with Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅྭ་བརྒྱད་ཡབ་ནི་ལེགས་བཟང་ཡིན། །པད་མ་ཅན་ཞེས་བྱ་བ་དེ་ཡི་ཡུམ། །
en: “His family will be brahmin and his light will extend eighteen leagues. Exquisite Excellence will be his father; Lotus Possessor will be his mother.

source: སྲས་པོ་གཙོ་མཆོག་ཆོས་ནི་རིམ་གྲོ་པ། །
en: Supreme Leader will be his son and Dharma his attendant.

source: འོད་ཟེར་བརྒྱ་པ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Hundred Light Rays will be the scholar

source: རབ་ཏུ་འཇོམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Conqueror the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཐམས་ཅད་ལའང་། །དགྲ་བཅོམ་ཆགས་མེད་འདམ་བརྒལ་སྦྱངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བཅུ་བཅུ་ཁོ་ན་ཡོད། །
en: There will be ten congregations, Each of them gathering one hundred million “Accomplished worthy ones free from attachment, who have gone beyond the swamp.

source: མི་ཚེའི་ཚད་ནི་ལོ་གྲངས་སུམ་བརྒྱ་ཡིན། །
en: The lifespan of humans will be three hundred years,

source: རྣམ་པར་གྲོལ་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ཡི་བར་དུ་གནས། །
en: And after the teacher has reached liberation His sacred Dharma will remain for ten thousand years.

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་གཉིས་ཡོད་དེ། །གསེར་ལས་བྱས་པའི་དྲ་བས་ཀུན་ཏུ་གཡོགས། །
en: “There will be two billion stūpas Draped in nets of gold.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོར་གཤེགས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡིས་སྤྲུལ་ཅེས་བྱ། །
en: The thus-gone Atyuccagāmin Will be born in a place called Created by Gods.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་གཉིས་ཡོད་ལྗོན་པའི་དབང་པོ་ཡབ། །དགའ་བ་ཅན་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཡོན་ཏན་དགའ་བ་རྒྱལ་བ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya and his light will extend ninety-two leagues. King of Trees will be his father; Possessor of Joy will be his mother. Qualities of Joy will be his son and Conqueror his attendant.

source: དགྲ་བཅོམ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joyous Worthy One will be the scholar

source: དགེ་སློང་སྐར་མཁན་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And the monk Famed Astrologer the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་སེམས་ཞི་དུལ་བར་ལྡན་པ་དག །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be sixty-six congregations, Each of them gathering two hundred twenty million “Beings of peace and gentleness.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཞི་བཅུ་ཡིན། །
en: The lifespan of humans will be forty thousand years,

source: རྟོག་པ་མེད་པ་དེ་ཡི་དམ་ཆོས་དག །
en: And the sacred Dharma of the one free from thought

source: ལོ་གྲངས་སྟོང་ཕྲག་དགུ་ཡི་བར་དུ་གནས། །
en: Will remain for nine thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་གཅིག །གསེར་དག་གིས་ནི་རྣམ་པར་སྤྲས་པར་འགྱུར། །
en: “There will be a single stūpa of this victorious one, Three leagues tall and ornamented with gold.

source: མི་ཡི་མཆོག་མ་སྐྱེ་བའི་དབང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་འཕགས་ཞེས་བྱ། །
en: The supreme human, Janendra, Will be born in a place called Superior World.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ཤིན་ཏུ་མཆོད། །འཇིགས་པ་མེད་པ་ཡུམ་ཡིན་སྲས་པོ་ནི། །འཇིག་རྟེན་དགའ་བ་རྒྱལ་བ་རིམ་གྲོ་པ། །
en: “His family will be brahmin and his light will extend three leagues. Highest Veneration will be his father; Fearless will be his mother. Joy for the World will be his son and Conqueror his attendant.

source: ཚོགས་ཅན་བློ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Wisdom of the Gathering will be the scholar

source: འབྲུག་སྒྲ་དབྱངས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Melodious Thunder the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བཅུ་དྲུག་སྟེ། །ཀུན་ལའང་དྲི་གསུམ་དྲི་དག་ཡིད་ལྡན་པ། །སེམས་སྦྱངས་བྱེ་བ་ཕྲག་ནི་དྲུག་དྲུག་ཡོད། །
en: There will be sixteen congregations, Each of them gathering sixty million “Purified and well-trained minds free from the three stains.

source: མི་ཚེའི་ཚད་ནི་ལོ་གྲངས་ཉིས་སྟོང་ཡིན། །
en: The lifespan of humans will be two thousand years,

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་གཉིས་སུ་གནས། །
en: And after this victor has attained nirvāṇa His sacred Dharma will remain for seventy-two thousand years.

source: མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་གཉིས་ཚང་སྟེ། །རིན་པོ་ཆེ་ཡིས་རྣམ་པར་སྤྲས་པར་འགྱུར། །
en: “There will be twenty billion stūpas Studded with jewels.

source: སྨྲ་བའི་ཟླ་བ་བློ་གྲོས་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ངེས་པའི་མདངས་ཞེས་བྱ། །
en: The moon of speech, Sumati, Will be born in a place called Certain Brightness.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་ཐོགས་པ་མེད། །རིན་ཆེན་ལྡན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya and his light will extend two leagues. Unimpeded will be his father, And Possessor of Jewels will be this victorious one’s mother.

source: སྲས་པོ་འཇོམས་བྱེད་བཟང་བྱིན་རིམ་གྲོ་པ། །
en: Crusher will be his son and Gift of Excellence his attendant.

source: དགེ་སློང་ཚོགས་ཅན་གཙོ་བོ་མཁས་པ་སྟེ། །
en: “The monk Leader of the Gathering will be the scholar

source: རྒོལ་བ་ཕུང་བྱེད་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Defeater of Attacks will be the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་དགུ་བཅུ་སྟེ། །ཀུན་ལའང་སྲེད་དང་དྲི་མ་ཐ་བ་དང་། །མདུད་པ་བཅད་པ་བྱེ་བ་ཕྲག་བཅུ་བཅུ། །
en: There will be ninety congregations, Each of them gathering one hundred million “Beings who have cut through the knots and are free from craving, stain, and defilement.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་བ་སྟོང་ཕྲག་བཅུ། །
en: The lifespan of humans will be one hundred billion years,

source: རྣམ་པར་གྲོལ་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་གཉིས་ཀྱི་བར་དུ་གནས། །
en: And after this teacher has entered liberation his sacred Dharma Will remain for two thousand years.

source: མཆོད་རྟེན་ཁྱད་འཕགས་དཔག་ཚད་གཅིག་པ་ལ། །རིན་ཆེན་ཁྱད་པར་འཕགས་པ་བརྒྱ་ཡིས་སྤྲས། །
en: “There will be a single, extraordinary stūpa, One league large and studded with hundreds of special jewels.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་འོད་ཀྱི་ནི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་འཕགས་ཞེས་བྱ། །
en: The thus-gone Lokaprabha Will be born in a place called Superior Splendor.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་ཡབ་ནི་ཟླ་བའི་རི། །མེ་ཏོག་ཅན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be kṣatriya and his light will extend sixty leagues. Moon Mountain will be his father And Endowed with Flowers his mother.

source: སྲས་པོ་དགའ་སྡུག་རྒྱལ་བྱེད་རིམ་གྲོ་པ། །
en: Beautiful Joy will be his son and Winner his attendant.

source: ཡོན་ཏན་གྲགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Famed Qualities will be the scholar

source: ཙན་དན་བཟང་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Excellent Sandalwood will be the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །འདུས་པ་ཀུན་ལའང་དགྲ་བཅོམ་བྱེ་བ་ཕྲག །སྟོང་ཕྲག་དགུ་བཅུ་རྩ་ནི་དགུ་དགུ་ཡོད། །
en: There will be sixty-six congregations, Each of them gathering “Nine hundred ninety billion worthy ones.

source: དམ་ཆོས་ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས། །
en: And the sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་ལ། །ཁོར་ཡུག་གསེར་ལས་བྱས་པའི་བླ་རེས་སྤྲས། །གདུགས་གྲངས་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་ཡང་ཡོད། །
en: The stūpa of this victorious one will be three leagues large, Shielded completely by a golden canopy And adorned with ten billion parasols.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཟི་བརྗིད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་རྣམ་འཕྲུལ་ཡིན། །
en: The thus-gone Ratnatejas Will be born in a place called Display of Merit.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གསུམ་ཡབ་ནི་པད་མ་བཟང་། །ཡོན་ཏན་སྨྲ་བ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །མེ་ཏོག་ལེགས་རྒྱས་སྐར་མ་རིམ་གྲོ་པ། །
en: “The family of this victor will be kṣatriya and his light will extend thirteen leagues. Excellent Lotus will be his father And Teacher of Qualities his mother. Blooming Flowers will be his son and Star his attendant.

source: དྲང་སྲོང་མང་པོས་བསྟོད་པ་མཁས་ལྡན་ཏེ། །
en: “Praised by Numerous Sages will be the scholar

source: འཇིག་རྟེན་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Joy for the World will be the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་ཐེར་འབུམ་སྟེ། །དེ་དག་ཀུན་ལའང་སེམས་སྦྱངས་མཆོད་གནས་དག །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་ཚང་བར་ཡོད། །
en: There will be one billion congregations, Each of them gathering “One billion beings of purified mind, worthy of worship.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་དགུ་སྟོང་ཡིན། །
en: The lifespan of humans will be nine thousand years,

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after this victor has attained nirvāṇa His sacred Dharma will remain for sixty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བརྒྱད་ཁྲི་དག་ནི་ཚང་བར་འགྱུར། །
en: “The relics of this victorious will be abundant And contained in eighty thousand stūpas.

source: བདེ་བར་གཤེགས་པ་སྐལ་ལྡན་ཤིང་རྟ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྐར་མའི་འོད་ཅེས་བྱ། །
en: The well-gone Bhāgīrathi Will be born in a place called Starlight.
